docs/test/sonos_test/postdata_purple.txt

<soap:Envelope soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><SetVolume xmlns="urn:schemas-upnp-org:service:RenderingControl:1"><InstanceID xsi:type="xsd:int">0</InstanceID><Channel xsi:type="xsd:string">Master</Channel><DesiredVolume xsi:type="xsd:int">24</DesiredVolume></SetVolume></soap:Body></soap:Envelope>
